# Vertex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MeshTriangle..::..Vertex Property
MeshTriangle Class See Also
---
A vertex of the triangle.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ this[
	int idx
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Vertex ( _
	idx As Integer _
) As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Vertex[int idx] {
	XYZ^ get (int idx);
}
```

# ### Parameters
idx
    Type: System..::..Int32Index of the vertex in the triangle: 0, 1 or 2.
# See Also
MeshTriangle Class
Autodesk.Revit.DB Namespace